# WORKING WITH SQL

In [17]:
#!pip install ipython-sql #-- install sq;

In [104]:
#load sql to notebook
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [105]:
# create a database connection
%sql sqlite:///testdb.sqlite

'Connected: @testdb.sqlite#'

In [106]:
%%sql
--- # The sql magic tells jupyter to interprete this cell as SQL
--- # In SQL comments begin with "---" (we add # to take advantage of jupyter's syntax highlighting)

--- #Since we are starting a new example, let's delete any existing table
DROP TABLE IF EXISTS customers;
DROP TABLE IF EXISTS products;
DROP TABLE IF EXISTS orders;

--- #Now let's make our tables
CREATE TABLE customers(
    id     INTEGER  NOT NULL PRIMARY KEY,
    name   TEXT NOT NULL,
    billing_address  TEXT NOT NULL
);

CREATE TABLE products(
    id INTEGER PRIMARY KEY NOT NULL,
    price INTEGER NOT NULL   
);

CREATE TABLE orders(
    id INTEGER NOT NULL,
    customer_id INTEGER NOT NULL,
    product_id NUMBER NOT NULL,
    delivery_address TEXT NOT NULL,
    FOREIGN KEY (customer_id) REFERENCES customers(id),
    FOREIGN KEY (product_id) REFERENCES products(id)
);

 * sqlite:///testdb.sqlite#
Done.
Done.
Done.
Done.
Done.
Done.

[]

#### --- # we would only be able to create rows with customers id whose id is also present in the customer's table

#### --- # by doing this we are setting up a relationship between customers table and orders table
 
#### --- # we would only be able to create rows with products id whose id also present in the product's table

In [107]:
%%sql
--- # our tables are inititally empty but we have defined the schema
---- # We can inspect the table by using SELECT
SELECT * FROM orders

 * sqlite:///testdb.sqlite#
Done.

[]

### INSERTING DATA INTO TABLES
--- # We have to be careful to do this in a certain order, when we defined the orders table,
we defined a relationsheip between the customer_id and product_id attributes and the id attributes in the customer and product tables respectively. We can only INSERT data into the orders tables once the appropriate customers and products exist in thier tables.

In [108]:
%%sql
--# starting with customers
INSERT INTO customers (id, name, billing_address)
    VALUES (435, 'Omar', 'Berlin, Germany'), (5692, 'Stuart', 'Dover, UK'), (6127,
                                                                             'Vidhya', 'Mumbai, India');
INSERT INTO products (id, price)
    VALUES (103, 6.95), (4028, 35.5), (3158, 101.99), (2561, 21.35), (89, 16.95);

INSERT INTO orders (id, customer_id, product_id, delivery_address)
    VALUES (62533, 435, 103, 'Munich, Germany'), (62353, 435, 4028, 'Tunis, Tunisia');
    
INSERT INTO orders (id, customer_id, product_id, delivery_address)
    VALUES (64598, 5692, 103, 'Dover, UK'), (65271, 5692, 103, 'Dover, UK');
    
INSERT INTO orders (id, customer_id, product_id, delivery_address)
    VALUES(23453, 6127, 3158, 'Lagos Nigeria'), (43213, 5692, 2561, 'Ottawa, Canada'), (12345, 435, 3158, 'Lagos Nigeria');

 * sqlite:///testdb.sqlite#
Done.
5 rows affected.
2 rows affected.
2 rows affected.
3 rows affected.

[]

In [109]:
%%sql
SELECT * FROM customers;

 * sqlite:///testdb.sqlite#
Done.

[(435, 'Omar', 'Berlin, Germany'),
 (5692, 'Stuart', 'Dover, UK'),
 (6127, 'Vidhya', 'Mumbai, India')]

In [110]:
%%sql
SELECT * FROM products;

 * sqlite:///testdb.sqlite#
Done.

[(89, 16.95), (103, 6.95), (2561, 21.35), (3158, 101.99), (4028, 35.5)]

In [111]:
%%sql 
SELECT * FROM orders;

 * sqlite:///testdb.sqlite#
Done.

[(62533, 435, 103, 'Munich, Germany'),
 (62353, 435, 4028, 'Tunis, Tunisia'),
 (64598, 5692, 103, 'Dover, UK'),
 (65271, 5692, 103, 'Dover, UK'),
 (23453, 6127, 3158, 'Lagos Nigeria'),
 (43213, 5692, 2561, 'Ottawa, Canada'),
 (12345, 435, 3158, 'Lagos Nigeria')]

### Just like head/tail in pandas, we can limit how much gets printed from SQL table by using the limit command

In [112]:
%%sql
SELECT * FROM orders
LIMIT 5;

 * sqlite:///testdb.sqlite#
Done.

[(62533, 435, 103, 'Munich, Germany'),
 (62353, 435, 4028, 'Tunis, Tunisia'),
 (64598, 5692, 103, 'Dover, UK'),
 (65271, 5692, 103, 'Dover, UK'),
 (23453, 6127, 3158, 'Lagos Nigeria')]